[{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: Lion told lies today.",
"solution": "Wednesday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today could be Monday, Tuesday, or Wednesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Monday, Tuesday, or Wednesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Monday, Tuesday, Wednesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "1"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: Lion will tell lies tomorrow.",
"solution": "Sunday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today could be Sunday, Monday, or Tuesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday, Monday, or Tuesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Monday, Tuesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Sunday.",
"id": "2"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: Lion told lies yesterday.",
"solution": "Wednesday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today could be Tuesday, Wednesday, or Thursday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Tuesday or Wednesday, and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Tuesday, Wednesday, Friday, or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "3"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: Lion told truths today.",
"solution": "Sunday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today could be Thursday, Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Sunday. Based on what both are saying, the only day it could be is Sunday.",
"id": "4"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "5"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: Lion told truths yesterday.",
"solution": "Sunday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today could be Friday, Saturday, Sunday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday or Monday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday, Monday, or Thursday. Based on what both are saying, the only day it could be is Sunday.",
"id": "6"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: I will tell lies tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today could be Wednesday, Thursday, or Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can only be Saturday. All told, from what Unicorn says, it could be Wednesday or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "7"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Sunday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Sunday.",
"id": "8"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: I will tell truths tomorrow.",
"solution": "Sunday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today could be Sunday, Monday, Tuesday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday, Monday, or Tuesday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Monday, Tuesday, Thursday, or Friday. Based on what both are saying, the only day it could be is Sunday.",
"id": "9"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: I told truths yesterday.",
"solution": "Wednesday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Tuesday, Wednesday, or Monday, and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Tuesday, Wednesday, Monday, Friday, or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "10"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: Today is Wednesday.",
"solution": "Wednesday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today is Wednesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Wednesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "11"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: Today is Sunday.",
"solution": "Sunday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today is Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Sunday.",
"id": "12"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: Today is a weekday.",
"solution": "Wednesday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today could be Monday, Tuesday, Wednesday, Thursday, or Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Monday, Tuesday, or Wednesday, and if Unicorn is lying, it can only be Saturday. All told, from what Unicorn says, it could be Monday, Tuesday, Wednesday, or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "13"}, 
{"lion": "The Lion says: I will tell lies tomorrow.",
"unicorn": "The Unicorn says: It is the weekend.",
"solution": "Sunday",
"explanation": "Lion says today could be Sunday, Monday, or Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday or Wednesday. Unicorn says today could be Saturday or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Thursday, or Friday. Based on what both are saying, the only day it could be is Sunday.",
"id": "14"}, 
{"lion": "The Lion says: I told lies yesterday.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, or Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can only be Monday. All told, from what Lion says, it could be Thursday or Monday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Thursday.",
"id": "15"}, 
{"lion": "The Lion says: I told lies yesterday.",
"unicorn": "The Unicorn says: I told truths yesterday.",
"solution": "Monday",
"explanation": "Lion says today could be Tuesday, Wednesday, or Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can only be Monday. All told, from what Lion says, it could be Thursday or Monday. Unicorn says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Tuesday, Wednesday, or Monday, and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Tuesday, Wednesday, Monday, Friday, or Saturday. Based on what both are saying, the only day it could be is Monday.",
"id": "16"}, 
{"lion": "The Lion says: I told lies yesterday.",
"unicorn": "The Unicorn says: Today is Tuesday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, or Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can only be Monday. All told, from what Lion says, it could be Thursday or Monday. Unicorn says today is Tuesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Tuesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Tuesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "17"}, 
{"lion": "The Lion says: I told lies yesterday.",
"unicorn": "The Unicorn says: Today is Wednesday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, or Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can only be Monday. All told, from what Lion says, it could be Thursday or Monday. Unicorn says today is Wednesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Wednesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "18"}, 
{"lion": "The Lion says: I told lies yesterday.",
"unicorn": "The Unicorn says: Today is Friday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, or Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can only be Monday. All told, from what Lion says, it could be Thursday or Monday. Unicorn says today is Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Saturday. All told, from what Unicorn says, it could be Thursday or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "19"}, 
{"lion": "The Lion says: I told lies yesterday.",
"unicorn": "The Unicorn says: Today is Saturday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, or Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can only be Monday. All told, from what Lion says, it could be Thursday or Monday. Unicorn says today is Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Thursday or Friday. Based on what both are saying, the only day it could be is Thursday.",
"id": "20"}, 
{"lion": "The Lion says: I told lies yesterday.",
"unicorn": "The Unicorn says: Today is Sunday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, or Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can only be Monday. All told, from what Lion says, it could be Thursday or Monday. Unicorn says today is Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "21"}, 
{"lion": "The Lion says: I told lies yesterday.",
"unicorn": "The Unicorn says: Today is a weekday.",
"solution": "Monday",
"explanation": "Lion says today could be Tuesday, Wednesday, or Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can only be Monday. All told, from what Lion says, it could be Thursday or Monday. Unicorn says today could be Monday, Tuesday, Wednesday, Thursday, or Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Monday, Tuesday, or Wednesday, and if Unicorn is lying, it can only be Saturday. All told, from what Unicorn says, it could be Monday, Tuesday, Wednesday, or Saturday. Based on what both are saying, the only day it could be is Monday.",
"id": "22"}, 
{"lion": "The Lion says: I told lies yesterday.",
"unicorn": "The Unicorn says: It is the weekend.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, or Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can only be Monday. All told, from what Lion says, it could be Thursday or Monday. Unicorn says today could be Saturday or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Thursday, or Friday. Based on what both are saying, the only day it could be is Thursday.",
"id": "23"}, 
{"lion": "The Lion says: I told truths today.",
"unicorn": "The Unicorn says: Lion told truths today.",
"solution": "Sunday",
"explanation": "Lion says today could be Thursday, Friday, Saturday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday, Friday, Saturday, or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Thursday, Friday, Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Thursday, Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Sunday. Based on what both are saying, the only day it could be is Sunday.",
"id": "24"}, 
{"lion": "The Lion says: I told truths today.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today could be Thursday, Friday, Saturday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday, Friday, Saturday, or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Thursday, Friday, Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "25"}, 
{"lion": "The Lion says: I will tell truths tomorrow.",
"unicorn": "The Unicorn says: I will tell lies tomorrow.",
"solution": "Saturday",
"explanation": "Lion says today could be Wednesday, Thursday, Friday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday, Friday, or Saturday, and if Lion is lying, it can be Monday or Tuesday. All told, from what Lion says, it could be Thursday, Friday, Saturday, Monday, or Tuesday. Unicorn says today could be Wednesday, Thursday, or Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can only be Saturday. All told, from what Unicorn says, it could be Wednesday or Saturday. Based on what both are saying, the only day it could be is Saturday.",
"id": "26"}, 
{"lion": "The Lion says: I will tell truths tomorrow.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Thursday",
"explanation": "Lion says today could be Wednesday, Thursday, Friday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday, Friday, or Saturday, and if Lion is lying, it can be Monday or Tuesday. All told, from what Lion says, it could be Thursday, Friday, Saturday, Monday, or Tuesday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Thursday.",
"id": "27"}, 
{"lion": "The Lion says: I told truths yesterday.",
"unicorn": "The Unicorn says: Lion told truths today.",
"solution": "Sunday",
"explanation": "Lion says today could be Friday, Saturday, Sunday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Friday, Saturday, or Sunday, and if Lion is lying, it can be Tuesday or Wednesday. All told, from what Lion says, it could be Friday, Saturday, Sunday, Tuesday, or Wednesday. Unicorn says today could be Thursday, Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Sunday. Based on what both are saying, the only day it could be is Sunday.",
"id": "28"}, 
{"lion": "The Lion says: I told truths yesterday.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today could be Friday, Saturday, Sunday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Friday, Saturday, or Sunday, and if Lion is lying, it can be Tuesday or Wednesday. All told, from what Lion says, it could be Friday, Saturday, Sunday, Tuesday, or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "29"}, 
{"lion": "The Lion says: I told truths yesterday.",
"unicorn": "The Unicorn says: Lion told truths yesterday.",
"solution": "Sunday",
"explanation": "Lion says today could be Friday, Saturday, Sunday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Friday, Saturday, or Sunday, and if Lion is lying, it can be Tuesday or Wednesday. All told, from what Lion says, it could be Friday, Saturday, Sunday, Tuesday, or Wednesday. Unicorn says today could be Friday, Saturday, Sunday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday or Monday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday, Monday, or Thursday. Based on what both are saying, the only day it could be is Sunday.",
"id": "30"}, 
{"lion": "The Lion says: I told truths yesterday.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Sunday",
"explanation": "Lion says today could be Friday, Saturday, Sunday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Friday, Saturday, or Sunday, and if Lion is lying, it can be Tuesday or Wednesday. All told, from what Lion says, it could be Friday, Saturday, Sunday, Tuesday, or Wednesday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Sunday.",
"id": "31"}, 
{"lion": "The Lion says: I told truths yesterday.",
"unicorn": "The Unicorn says: Today is Friday.",
"solution": "Saturday",
"explanation": "Lion says today could be Friday, Saturday, Sunday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Friday, Saturday, or Sunday, and if Lion is lying, it can be Tuesday or Wednesday. All told, from what Lion says, it could be Friday, Saturday, Sunday, Tuesday, or Wednesday. Unicorn says today is Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Saturday. All told, from what Unicorn says, it could be Thursday or Saturday. Based on what both are saying, the only day it could be is Saturday.",
"id": "32"}, 
{"lion": "The Lion says: I told truths yesterday.",
"unicorn": "The Unicorn says: Today is Saturday.",
"solution": "Friday",
"explanation": "Lion says today could be Friday, Saturday, Sunday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Friday, Saturday, or Sunday, and if Lion is lying, it can be Tuesday or Wednesday. All told, from what Lion says, it could be Friday, Saturday, Sunday, Tuesday, or Wednesday. Unicorn says today is Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Thursday or Friday. Based on what both are saying, the only day it could be is Friday.",
"id": "33"}, 
{"lion": "The Lion says: Unicorn told lies today.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today could be Thursday, Friday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday, Friday, or Saturday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Thursday, Friday, Saturday, Monday, Tuesday, or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "34"}, 
{"lion": "The Lion says: Unicorn told lies today.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Thursday",
"explanation": "Lion says today could be Thursday, Friday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday, Friday, or Saturday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Thursday, Friday, Saturday, Monday, Tuesday, or Wednesday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Thursday.",
"id": "35"}, 
{"lion": "The Lion says: Unicorn will tell lies tomorrow.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Thursday",
"explanation": "Lion says today could be Wednesday, Thursday, or Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday or Friday, and if Lion is lying, it can be Monday or Tuesday. All told, from what Lion says, it could be Thursday, Friday, Monday, or Tuesday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Thursday.",
"id": "36"}, 
{"lion": "The Lion says: Unicorn will tell lies tomorrow.",
"unicorn": "The Unicorn says: Today is Thursday.",
"solution": "Friday",
"explanation": "Lion says today could be Wednesday, Thursday, or Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday or Friday, and if Lion is lying, it can be Monday or Tuesday. All told, from what Lion says, it could be Thursday, Friday, Monday, or Tuesday. Unicorn says today is Thursday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Friday or Saturday. Based on what both are saying, the only day it could be is Friday.",
"id": "37"}, 
{"lion": "The Lion says: Unicorn will tell lies tomorrow.",
"unicorn": "The Unicorn says: Today is Friday.",
"solution": "Thursday",
"explanation": "Lion says today could be Wednesday, Thursday, or Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday or Friday, and if Lion is lying, it can be Monday or Tuesday. All told, from what Lion says, it could be Thursday, Friday, Monday, or Tuesday. Unicorn says today is Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Saturday. All told, from what Unicorn says, it could be Thursday or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "38"}, 
{"lion": "The Lion says: Unicorn told lies yesterday.",
"unicorn": "The Unicorn says: Lion told truths today.",
"solution": "Sunday",
"explanation": "Lion says today could be Friday, Saturday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Friday, Saturday, or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Friday, Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Thursday, Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Sunday. Based on what both are saying, the only day it could be is Sunday.",
"id": "39"}, 
{"lion": "The Lion says: Unicorn told lies yesterday.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today could be Friday, Saturday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Friday, Saturday, or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Friday, Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "40"}, 
{"lion": "The Lion says: Unicorn told lies yesterday.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Sunday",
"explanation": "Lion says today could be Friday, Saturday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Friday, Saturday, or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Friday, Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Sunday.",
"id": "41"}, 
{"lion": "The Lion says: Unicorn told lies yesterday.",
"unicorn": "The Unicorn says: Today is Friday.",
"solution": "Saturday",
"explanation": "Lion says today could be Friday, Saturday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Friday, Saturday, or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Friday, Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today is Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Saturday. All told, from what Unicorn says, it could be Thursday or Saturday. Based on what both are saying, the only day it could be is Saturday.",
"id": "42"}, 
{"lion": "The Lion says: Unicorn told lies yesterday.",
"unicorn": "The Unicorn says: Today is Saturday.",
"solution": "Friday",
"explanation": "Lion says today could be Friday, Saturday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Friday, Saturday, or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Friday, Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today is Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Thursday or Friday. Based on what both are saying, the only day it could be is Friday.",
"id": "43"}, 
{"lion": "The Lion says: Unicorn told truths today.",
"unicorn": "The Unicorn says: Lion will tell lies tomorrow.",
"solution": "Sunday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Sunday. Unicorn says today could be Sunday, Monday, or Tuesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday, Monday, or Tuesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Monday, Tuesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Sunday.",
"id": "44"}, 
{"lion": "The Lion says: Unicorn told truths today.",
"unicorn": "The Unicorn says: Lion told truths today.",
"solution": "Sunday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Sunday. Unicorn says today could be Thursday, Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Sunday. Based on what both are saying, the only day it could be is Sunday.",
"id": "45"}, 
{"lion": "The Lion says: Unicorn told truths today.",
"unicorn": "The Unicorn says: Lion told truths yesterday.",
"solution": "Sunday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Sunday. Unicorn says today could be Friday, Saturday, Sunday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday or Monday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday, Monday, or Thursday. Based on what both are saying, the only day it could be is Sunday.",
"id": "46"}, 
{"lion": "The Lion says: Unicorn told truths today.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Sunday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Sunday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Sunday.",
"id": "47"}, 
{"lion": "The Lion says: Unicorn told truths today.",
"unicorn": "The Unicorn says: I told truths today.",
"solution": "Sunday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Sunday. Unicorn says today could be Monday, Tuesday, Wednesday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Monday, Tuesday, Wednesday, or Sunday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Monday, Tuesday, Wednesday, Sunday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Sunday.",
"id": "48"}, 
{"lion": "The Lion says: Unicorn told truths today.",
"unicorn": "The Unicorn says: I will tell truths tomorrow.",
"solution": "Sunday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Sunday. Unicorn says today could be Sunday, Monday, Tuesday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday, Monday, or Tuesday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Monday, Tuesday, Thursday, or Friday. Based on what both are saying, the only day it could be is Sunday.",
"id": "49"}, 
{"lion": "The Lion says: Unicorn told truths today.",
"unicorn": "The Unicorn says: Today is Sunday.",
"solution": "Sunday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Sunday. Unicorn says today is Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Sunday.",
"id": "50"}, 
{"lion": "The Lion says: Unicorn told truths today.",
"unicorn": "The Unicorn says: It is the weekend.",
"solution": "Sunday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Sunday. Unicorn says today could be Saturday or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Thursday, or Friday. Based on what both are saying, the only day it could be is Sunday.",
"id": "51"}, 
{"lion": "The Lion says: Unicorn will tell truths tomorrow.",
"unicorn": "The Unicorn says: Lion told truths today.",
"solution": "Sunday",
"explanation": "Lion says today could be Sunday, Monday, Tuesday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Sunday or Saturday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday, Saturday, or Wednesday. Unicorn says today could be Thursday, Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Sunday. Based on what both are saying, the only day it could be is Sunday.",
"id": "52"}, 
{"lion": "The Lion says: Unicorn will tell truths tomorrow.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today could be Sunday, Monday, Tuesday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Sunday or Saturday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday, Saturday, or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "53"}, 
{"lion": "The Lion says: Unicorn will tell truths tomorrow.",
"unicorn": "The Unicorn says: Lion told truths yesterday.",
"solution": "Sunday",
"explanation": "Lion says today could be Sunday, Monday, Tuesday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Sunday or Saturday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday, Saturday, or Wednesday. Unicorn says today could be Friday, Saturday, Sunday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday or Monday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday, Monday, or Thursday. Based on what both are saying, the only day it could be is Sunday.",
"id": "54"}, 
{"lion": "The Lion says: Unicorn will tell truths tomorrow.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Sunday",
"explanation": "Lion says today could be Sunday, Monday, Tuesday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Sunday or Saturday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday, Saturday, or Wednesday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Sunday.",
"id": "55"}, 
{"lion": "The Lion says: Unicorn will tell truths tomorrow.",
"unicorn": "The Unicorn says: I will tell truths tomorrow.",
"solution": "Sunday",
"explanation": "Lion says today could be Sunday, Monday, Tuesday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Sunday or Saturday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday, Saturday, or Wednesday. Unicorn says today could be Sunday, Monday, Tuesday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday, Monday, or Tuesday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Monday, Tuesday, Thursday, or Friday. Based on what both are saying, the only day it could be is Sunday.",
"id": "56"}, 
{"lion": "The Lion says: Unicorn will tell truths tomorrow.",
"unicorn": "The Unicorn says: Today is Monday.",
"solution": "Saturday",
"explanation": "Lion says today could be Sunday, Monday, Tuesday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Sunday or Saturday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday, Saturday, or Wednesday. Unicorn says today is Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Monday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Monday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Saturday.",
"id": "57"}, 
{"lion": "The Lion says: Unicorn will tell truths tomorrow.",
"unicorn": "The Unicorn says: Today is Tuesday.",
"solution": "Saturday",
"explanation": "Lion says today could be Sunday, Monday, Tuesday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Sunday or Saturday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday, Saturday, or Wednesday. Unicorn says today is Tuesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Tuesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Tuesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Saturday.",
"id": "58"}, 
{"lion": "The Lion says: Unicorn will tell truths tomorrow.",
"unicorn": "The Unicorn says: Today is Thursday.",
"solution": "Saturday",
"explanation": "Lion says today could be Sunday, Monday, Tuesday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Sunday or Saturday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday, Saturday, or Wednesday. Unicorn says today is Thursday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Friday or Saturday. Based on what both are saying, the only day it could be is Saturday.",
"id": "59"}, 
{"lion": "The Lion says: Unicorn will tell truths tomorrow.",
"unicorn": "The Unicorn says: Today is Friday.",
"solution": "Saturday",
"explanation": "Lion says today could be Sunday, Monday, Tuesday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Sunday or Saturday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday, Saturday, or Wednesday. Unicorn says today is Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Saturday. All told, from what Unicorn says, it could be Thursday or Saturday. Based on what both are saying, the only day it could be is Saturday.",
"id": "60"}, 
{"lion": "The Lion says: Unicorn will tell truths tomorrow.",
"unicorn": "The Unicorn says: It is the weekend.",
"solution": "Sunday",
"explanation": "Lion says today could be Sunday, Monday, Tuesday, or Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Sunday or Saturday, and if Lion is lying, it can only be Wednesday. All told, from what Lion says, it could be Sunday, Saturday, or Wednesday. Unicorn says today could be Saturday or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Thursday, or Friday. Based on what both are saying, the only day it could be is Sunday.",
"id": "61"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: Lion told lies today.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today could be Monday, Tuesday, or Wednesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Monday, Tuesday, or Wednesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Monday, Tuesday, Wednesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "62"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: Lion will tell lies tomorrow.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today could be Sunday, Monday, or Tuesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday, Monday, or Tuesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Monday, Tuesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "63"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: Lion told truths yesterday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today could be Friday, Saturday, Sunday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday or Monday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday, Monday, or Thursday. Based on what both are saying, the only day it could be is Thursday.",
"id": "64"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Thursday.",
"id": "65"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: I told truths today.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today could be Monday, Tuesday, Wednesday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Monday, Tuesday, Wednesday, or Sunday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Monday, Tuesday, Wednesday, Sunday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "66"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: I will tell truths tomorrow.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today could be Sunday, Monday, Tuesday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday, Monday, or Tuesday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Monday, Tuesday, Thursday, or Friday. Based on what both are saying, the only day it could be is Thursday.",
"id": "67"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: Today is Monday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today is Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Monday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Monday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "68"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: Today is Tuesday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today is Tuesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Tuesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Tuesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "69"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: Today is Wednesday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today is Wednesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Wednesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "70"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: Today is Friday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today is Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Saturday. All told, from what Unicorn says, it could be Thursday or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "71"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: Today is Saturday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today is Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Thursday or Friday. Based on what both are saying, the only day it could be is Thursday.",
"id": "72"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: Today is Sunday.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today is Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "73"}, 
{"lion": "The Lion says: Unicorn told truths yesterday.",
"unicorn": "The Unicorn says: It is the weekend.",
"solution": "Thursday",
"explanation": "Lion says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could only be Thursday. Unicorn says today could be Saturday or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Thursday, or Friday. Based on what both are saying, the only day it could be is Thursday.",
"id": "74"}, 
{"lion": "The Lion says: Today is Monday.",
"unicorn": "The Unicorn says: Lion will tell lies tomorrow.",
"solution": "Tuesday",
"explanation": "Lion says today is Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Tuesday or Wednesday. All told, from what Lion says, it could be Tuesday or Wednesday. Unicorn says today could be Sunday, Monday, or Tuesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday, Monday, or Tuesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Monday, Tuesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Tuesday.",
"id": "75"}, 
{"lion": "The Lion says: Today is Monday.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today is Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Tuesday or Wednesday. All told, from what Lion says, it could be Tuesday or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "76"}, 
{"lion": "The Lion says: Today is Monday.",
"unicorn": "The Unicorn says: I will tell lies tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today is Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Tuesday or Wednesday. All told, from what Lion says, it could be Tuesday or Wednesday. Unicorn says today could be Wednesday, Thursday, or Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can only be Saturday. All told, from what Unicorn says, it could be Wednesday or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "77"}, 
{"lion": "The Lion says: Today is Monday.",
"unicorn": "The Unicorn says: I will tell truths tomorrow.",
"solution": "Tuesday",
"explanation": "Lion says today is Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Tuesday or Wednesday. All told, from what Lion says, it could be Tuesday or Wednesday. Unicorn says today could be Sunday, Monday, Tuesday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday, Monday, or Tuesday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Monday, Tuesday, Thursday, or Friday. Based on what both are saying, the only day it could be is Tuesday.",
"id": "78"}, 
{"lion": "The Lion says: Today is Monday.",
"unicorn": "The Unicorn says: Today is Tuesday.",
"solution": "Tuesday",
"explanation": "Lion says today is Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Tuesday or Wednesday. All told, from what Lion says, it could be Tuesday or Wednesday. Unicorn says today is Tuesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Tuesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Tuesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Tuesday.",
"id": "79"}, 
{"lion": "The Lion says: Today is Monday.",
"unicorn": "The Unicorn says: Today is Wednesday.",
"solution": "Wednesday",
"explanation": "Lion says today is Monday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Tuesday or Wednesday. All told, from what Lion says, it could be Tuesday or Wednesday. Unicorn says today is Wednesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Wednesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "80"}, 
{"lion": "The Lion says: Today is Tuesday.",
"unicorn": "The Unicorn says: Lion will tell lies tomorrow.",
"solution": "Monday",
"explanation": "Lion says today is Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Monday or Wednesday. All told, from what Lion says, it could be Monday or Wednesday. Unicorn says today could be Sunday, Monday, or Tuesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday, Monday, or Tuesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Monday, Tuesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Monday.",
"id": "81"}, 
{"lion": "The Lion says: Today is Tuesday.",
"unicorn": "The Unicorn says: Lion told lies yesterday.",
"solution": "Wednesday",
"explanation": "Lion says today is Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Monday or Wednesday. All told, from what Lion says, it could be Monday or Wednesday. Unicorn says today could be Tuesday, Wednesday, or Thursday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Tuesday or Wednesday, and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Tuesday, Wednesday, Friday, or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "82"}, 
{"lion": "The Lion says: Today is Tuesday.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today is Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Monday or Wednesday. All told, from what Lion says, it could be Monday or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "83"}, 
{"lion": "The Lion says: Today is Tuesday.",
"unicorn": "The Unicorn says: Lion told truths yesterday.",
"solution": "Monday",
"explanation": "Lion says today is Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Monday or Wednesday. All told, from what Lion says, it could be Monday or Wednesday. Unicorn says today could be Friday, Saturday, Sunday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday or Monday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday, Monday, or Thursday. Based on what both are saying, the only day it could be is Monday.",
"id": "84"}, 
{"lion": "The Lion says: Today is Tuesday.",
"unicorn": "The Unicorn says: I will tell lies tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today is Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Monday or Wednesday. All told, from what Lion says, it could be Monday or Wednesday. Unicorn says today could be Wednesday, Thursday, or Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can only be Saturday. All told, from what Unicorn says, it could be Wednesday or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "85"}, 
{"lion": "The Lion says: Today is Tuesday.",
"unicorn": "The Unicorn says: I will tell truths tomorrow.",
"solution": "Monday",
"explanation": "Lion says today is Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Monday or Wednesday. All told, from what Lion says, it could be Monday or Wednesday. Unicorn says today could be Sunday, Monday, Tuesday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday, Monday, or Tuesday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Monday, Tuesday, Thursday, or Friday. Based on what both are saying, the only day it could be is Monday.",
"id": "86"}, 
{"lion": "The Lion says: Today is Tuesday.",
"unicorn": "The Unicorn says: Today is Monday.",
"solution": "Monday",
"explanation": "Lion says today is Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Monday or Wednesday. All told, from what Lion says, it could be Monday or Wednesday. Unicorn says today is Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Monday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Monday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Monday.",
"id": "87"}, 
{"lion": "The Lion says: Today is Tuesday.",
"unicorn": "The Unicorn says: Today is Wednesday.",
"solution": "Wednesday",
"explanation": "Lion says today is Tuesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Monday or Wednesday. All told, from what Lion says, it could be Monday or Wednesday. Unicorn says today is Wednesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Wednesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "88"}, 
{"lion": "The Lion says: Today is Wednesday.",
"unicorn": "The Unicorn says: Lion told lies yesterday.",
"solution": "Tuesday",
"explanation": "Lion says today is Wednesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Monday or Tuesday. All told, from what Lion says, it could be Monday or Tuesday. Unicorn says today could be Tuesday, Wednesday, or Thursday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Tuesday or Wednesday, and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Tuesday, Wednesday, Friday, or Saturday. Based on what both are saying, the only day it could be is Tuesday.",
"id": "89"}, 
{"lion": "The Lion says: Today is Wednesday.",
"unicorn": "The Unicorn says: Lion told truths yesterday.",
"solution": "Monday",
"explanation": "Lion says today is Wednesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Monday or Tuesday. All told, from what Lion says, it could be Monday or Tuesday. Unicorn says today could be Friday, Saturday, Sunday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday or Monday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday, Monday, or Thursday. Based on what both are saying, the only day it could be is Monday.",
"id": "90"}, 
{"lion": "The Lion says: Today is Wednesday.",
"unicorn": "The Unicorn says: Today is Monday.",
"solution": "Monday",
"explanation": "Lion says today is Wednesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Monday or Tuesday. All told, from what Lion says, it could be Monday or Tuesday. Unicorn says today is Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Monday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Monday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Monday.",
"id": "91"}, 
{"lion": "The Lion says: Today is Wednesday.",
"unicorn": "The Unicorn says: Today is Tuesday.",
"solution": "Tuesday",
"explanation": "Lion says today is Wednesday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can not be any day (so they must be lying), and if Lion is lying, it can be Monday or Tuesday. All told, from what Lion says, it could be Monday or Tuesday. Unicorn says today is Tuesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Tuesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Tuesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Tuesday.",
"id": "92"}, 
{"lion": "The Lion says: Today is Thursday.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today is Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Thursday, Monday, Tuesday, or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "93"}, 
{"lion": "The Lion says: Today is Thursday.",
"unicorn": "The Unicorn says: I will tell lies tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today is Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Thursday, Monday, Tuesday, or Wednesday. Unicorn says today could be Wednesday, Thursday, or Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can only be Saturday. All told, from what Unicorn says, it could be Wednesday or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "94"}, 
{"lion": "The Lion says: Today is Thursday.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Thursday",
"explanation": "Lion says today is Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Thursday, Monday, Tuesday, or Wednesday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Thursday.",
"id": "95"}, 
{"lion": "The Lion says: Today is Thursday.",
"unicorn": "The Unicorn says: Today is Friday.",
"solution": "Thursday",
"explanation": "Lion says today is Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Thursday, Monday, Tuesday, or Wednesday. Unicorn says today is Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Saturday. All told, from what Unicorn says, it could be Thursday or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "96"}, 
{"lion": "The Lion says: Today is Thursday.",
"unicorn": "The Unicorn says: Today is Saturday.",
"solution": "Thursday",
"explanation": "Lion says today is Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Thursday, Monday, Tuesday, or Wednesday. Unicorn says today is Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Thursday or Friday. Based on what both are saying, the only day it could be is Thursday.",
"id": "97"}, 
{"lion": "The Lion says: Today is Thursday.",
"unicorn": "The Unicorn says: Today is Sunday.",
"solution": "Thursday",
"explanation": "Lion says today is Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Thursday, Monday, Tuesday, or Wednesday. Unicorn says today is Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "98"}, 
{"lion": "The Lion says: Today is Thursday.",
"unicorn": "The Unicorn says: It is the weekend.",
"solution": "Thursday",
"explanation": "Lion says today is Thursday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Thursday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Thursday, Monday, Tuesday, or Wednesday. Unicorn says today could be Saturday or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Thursday, or Friday. Based on what both are saying, the only day it could be is Thursday.",
"id": "99"}, 
{"lion": "The Lion says: Today is Friday.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today is Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Friday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Friday, Monday, Tuesday, or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "100"}, 
{"lion": "The Lion says: Today is Friday.",
"unicorn": "The Unicorn says: Lion told truths yesterday.",
"solution": "Monday",
"explanation": "Lion says today is Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Friday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Friday, Monday, Tuesday, or Wednesday. Unicorn says today could be Friday, Saturday, Sunday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday or Monday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday, Monday, or Thursday. Based on what both are saying, the only day it could be is Monday.",
"id": "101"}, 
{"lion": "The Lion says: Today is Friday.",
"unicorn": "The Unicorn says: I will tell lies tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today is Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Friday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Friday, Monday, Tuesday, or Wednesday. Unicorn says today could be Wednesday, Thursday, or Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can only be Saturday. All told, from what Unicorn says, it could be Wednesday or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "102"}, 
{"lion": "The Lion says: Today is Friday.",
"unicorn": "The Unicorn says: Today is Thursday.",
"solution": "Friday",
"explanation": "Lion says today is Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Friday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Friday, Monday, Tuesday, or Wednesday. Unicorn says today is Thursday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Friday or Saturday. Based on what both are saying, the only day it could be is Friday.",
"id": "103"}, 
{"lion": "The Lion says: Today is Friday.",
"unicorn": "The Unicorn says: Today is Saturday.",
"solution": "Friday",
"explanation": "Lion says today is Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Friday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Friday, Monday, Tuesday, or Wednesday. Unicorn says today is Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Thursday or Friday. Based on what both are saying, the only day it could be is Friday.",
"id": "104"}, 
{"lion": "The Lion says: Today is Friday.",
"unicorn": "The Unicorn says: Today is Sunday.",
"solution": "Friday",
"explanation": "Lion says today is Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Friday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Friday, Monday, Tuesday, or Wednesday. Unicorn says today is Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Friday.",
"id": "105"}, 
{"lion": "The Lion says: Today is Friday.",
"unicorn": "The Unicorn says: It is the weekend.",
"solution": "Friday",
"explanation": "Lion says today is Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Friday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Friday, Monday, Tuesday, or Wednesday. Unicorn says today could be Saturday or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Thursday, or Friday. Based on what both are saying, the only day it could be is Friday.",
"id": "106"}, 
{"lion": "The Lion says: Today is Saturday.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today is Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Saturday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Saturday, Monday, Tuesday, or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "107"}, 
{"lion": "The Lion says: Today is Saturday.",
"unicorn": "The Unicorn says: Lion told truths yesterday.",
"solution": "Monday",
"explanation": "Lion says today is Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Saturday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Saturday, Monday, Tuesday, or Wednesday. Unicorn says today could be Friday, Saturday, Sunday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday or Monday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday, Monday, or Thursday. Based on what both are saying, the only day it could be is Monday.",
"id": "108"}, 
{"lion": "The Lion says: Today is Saturday.",
"unicorn": "The Unicorn says: Today is Thursday.",
"solution": "Saturday",
"explanation": "Lion says today is Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Saturday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Saturday, Monday, Tuesday, or Wednesday. Unicorn says today is Thursday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Friday or Saturday. Based on what both are saying, the only day it could be is Saturday.",
"id": "109"}, 
{"lion": "The Lion says: Today is Saturday.",
"unicorn": "The Unicorn says: Today is Friday.",
"solution": "Saturday",
"explanation": "Lion says today is Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Saturday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Saturday, Monday, Tuesday, or Wednesday. Unicorn says today is Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Saturday. All told, from what Unicorn says, it could be Thursday or Saturday. Based on what both are saying, the only day it could be is Saturday.",
"id": "110"}, 
{"lion": "The Lion says: Today is Saturday.",
"unicorn": "The Unicorn says: Today is Sunday.",
"solution": "Saturday",
"explanation": "Lion says today is Saturday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Saturday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Saturday, Monday, Tuesday, or Wednesday. Unicorn says today is Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Saturday.",
"id": "111"}, 
{"lion": "The Lion says: Today is Sunday.",
"unicorn": "The Unicorn says: Lion told truths today.",
"solution": "Sunday",
"explanation": "Lion says today is Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Thursday, Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Sunday. Based on what both are saying, the only day it could be is Sunday.",
"id": "112"}, 
{"lion": "The Lion says: Today is Sunday.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today is Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "113"}, 
{"lion": "The Lion says: Today is Sunday.",
"unicorn": "The Unicorn says: I will tell lies tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today is Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Wednesday, Thursday, or Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can only be Saturday. All told, from what Unicorn says, it could be Wednesday or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "114"}, 
{"lion": "The Lion says: Today is Sunday.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Sunday",
"explanation": "Lion says today is Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Sunday.",
"id": "115"}, 
{"lion": "The Lion says: Today is Sunday.",
"unicorn": "The Unicorn says: Today is Monday.",
"solution": "Monday",
"explanation": "Lion says today is Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Sunday, Monday, Tuesday, or Wednesday. Unicorn says today is Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Monday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Monday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Monday.",
"id": "116"}, 
{"lion": "The Lion says: Today is Sunday.",
"unicorn": "The Unicorn says: Today is Tuesday.",
"solution": "Tuesday",
"explanation": "Lion says today is Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Sunday, Monday, Tuesday, or Wednesday. Unicorn says today is Tuesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Tuesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Tuesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Tuesday.",
"id": "117"}, 
{"lion": "The Lion says: Today is Sunday.",
"unicorn": "The Unicorn says: Today is Wednesday.",
"solution": "Wednesday",
"explanation": "Lion says today is Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Sunday, Monday, Tuesday, or Wednesday. Unicorn says today is Wednesday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Wednesday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "118"}, 
{"lion": "The Lion says: Today is Sunday.",
"unicorn": "The Unicorn says: Today is Sunday.",
"solution": "Sunday",
"explanation": "Lion says today is Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Sunday, Monday, Tuesday, or Wednesday. Unicorn says today is Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday, Friday, or Saturday. All told, from what Unicorn says, it could be Sunday, Thursday, Friday, or Saturday. Based on what both are saying, the only day it could be is Sunday.",
"id": "119"}, 
{"lion": "The Lion says: Today is Sunday.",
"unicorn": "The Unicorn says: It is the weekend.",
"solution": "Sunday",
"explanation": "Lion says today is Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can only be Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Saturday or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Thursday, or Friday. Based on what both are saying, the only day it could be is Sunday.",
"id": "120"}, 
{"lion": "The Lion says: Today is a weekday.",
"unicorn": "The Unicorn says: Lion told lies yesterday.",
"solution": "Friday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, Thursday, or Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday or Friday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could be Thursday or Friday. Unicorn says today could be Tuesday, Wednesday, or Thursday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Tuesday or Wednesday, and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Tuesday, Wednesday, Friday, or Saturday. Based on what both are saying, the only day it could be is Friday.",
"id": "121"}, 
{"lion": "The Lion says: Today is a weekday.",
"unicorn": "The Unicorn says: Lion told truths yesterday.",
"solution": "Thursday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, Thursday, or Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday or Friday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could be Thursday or Friday. Unicorn says today could be Friday, Saturday, Sunday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Sunday or Monday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday, Monday, or Thursday. Based on what both are saying, the only day it could be is Thursday.",
"id": "122"}, 
{"lion": "The Lion says: Today is a weekday.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Thursday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, Thursday, or Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday or Friday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could be Thursday or Friday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Thursday.",
"id": "123"}, 
{"lion": "The Lion says: Today is a weekday.",
"unicorn": "The Unicorn says: I told truths yesterday.",
"solution": "Friday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, Thursday, or Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday or Friday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could be Thursday or Friday. Unicorn says today could be Tuesday, Wednesday, Thursday, or Monday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can be Tuesday, Wednesday, or Monday, and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Tuesday, Wednesday, Monday, Friday, or Saturday. Based on what both are saying, the only day it could be is Friday.",
"id": "124"}, 
{"lion": "The Lion says: Today is a weekday.",
"unicorn": "The Unicorn says: Today is Thursday.",
"solution": "Friday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, Thursday, or Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday or Friday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could be Thursday or Friday. Unicorn says today is Thursday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Friday or Saturday. Based on what both are saying, the only day it could be is Friday.",
"id": "125"}, 
{"lion": "The Lion says: Today is a weekday.",
"unicorn": "The Unicorn says: Today is Friday.",
"solution": "Thursday",
"explanation": "Lion says today could be Monday, Tuesday, Wednesday, Thursday, or Friday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Thursday or Friday, and if Lion is lying, it can not be any day (so they must be telling the truth). All told, from what Lion says, it could be Thursday or Friday. Unicorn says today is Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Saturday. All told, from what Unicorn says, it could be Thursday or Saturday. Based on what both are saying, the only day it could be is Thursday.",
"id": "126"}, 
{"lion": "The Lion says: It is the weekend.",
"unicorn": "The Unicorn says: Lion told truths today.",
"solution": "Sunday",
"explanation": "Lion says today could be Saturday or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Saturday or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Thursday, Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Sunday. Based on what both are saying, the only day it could be is Sunday.",
"id": "127"}, 
{"lion": "The Lion says: It is the weekend.",
"unicorn": "The Unicorn says: Lion will tell truths tomorrow.",
"solution": "Wednesday",
"explanation": "Lion says today could be Saturday or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Saturday or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Wednesday, Thursday, Friday, or Saturday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Wednesday, and if Unicorn is lying, it can not be any day (so they must be telling the truth). All told, from what Unicorn says, it could only be Wednesday. Based on what both are saying, the only day it could be is Wednesday.",
"id": "128"}, 
{"lion": "The Lion says: It is the weekend.",
"unicorn": "The Unicorn says: I told lies yesterday.",
"solution": "Sunday",
"explanation": "Lion says today could be Saturday or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Saturday or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Friday, Saturday, or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can only be Thursday. All told, from what Unicorn says, it could be Sunday or Thursday. Based on what both are saying, the only day it could be is Sunday.",
"id": "129"}, 
{"lion": "The Lion says: It is the weekend.",
"unicorn": "The Unicorn says: Today is Thursday.",
"solution": "Saturday",
"explanation": "Lion says today could be Saturday or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Saturday or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today is Thursday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Friday or Saturday. All told, from what Unicorn says, it could be Friday or Saturday. Based on what both are saying, the only day it could be is Saturday.",
"id": "130"}, 
{"lion": "The Lion says: It is the weekend.",
"unicorn": "The Unicorn says: Today is Friday.",
"solution": "Saturday",
"explanation": "Lion says today could be Saturday or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Saturday or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today is Friday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can not be any day (so they must be lying), and if Unicorn is lying, it can be Thursday or Saturday. All told, from what Unicorn says, it could be Thursday or Saturday. Based on what both are saying, the only day it could be is Saturday.",
"id": "131"}, 
{"lion": "The Lion says: It is the weekend.",
"unicorn": "The Unicorn says: It is the weekend.",
"solution": "Sunday",
"explanation": "Lion says today could be Saturday or Sunday. We know that Lion lies on Monday, Tuesday, and Wednesday. So if Lion is telling the truth it can be Saturday or Sunday, and if Lion is lying, it can be Monday, Tuesday, or Wednesday. All told, from what Lion says, it could be Saturday, Sunday, Monday, Tuesday, or Wednesday. Unicorn says today could be Saturday or Sunday. We know that Unicorn lies on Thursday, Friday, and Saturday. So if Unicorn is telling the truth it can only be Sunday, and if Unicorn is lying, it can be Thursday or Friday. All told, from what Unicorn says, it could be Sunday, Thursday, or Friday. Based on what both are saying, the only day it could be is Sunday.",
"id": "132"}]